Rebar is placed completely outside of its host.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId OutSideOfHost { get; }
  Visual Basic
Public Shared ReadOnly Property OutSideOfHost As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ OutSideOfHost {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarFailures Class
  Autodesk.Revit.DB Namespace